EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
      <div class="note">Hinweis: Änderungen werden beim Klicken auf "Anwenden" an den Server gesendet.</div>
    </form>
  </main>

  <h2>API-Einstellungen</h2>
  <main class="card">
    <form id="apiForm" method="POST" action="/preferences/api" autocomplete="off">
      <div class="toggle-row">
        <label for="apiToggle">API aktivieren</label>
        <label class="toggle-switch">
          <input type="checkbox" id="apiToggle" name="apiEnabled">
          <span class="slider"></span>
        </label>
      </div>
      <div class="controls">
        <button type="submit">Speichern</button>
      </div>
    </form>
  </main>

  <a href="https://github.com/EmilZander/Bushaltestelle-ESP8266">
    <div class="note">GitHub-Repo</div>
  </a>

  <script>
    const ssid = document.getElementById('ssid');
    const pwd = document.getElementById('pwd');
    const togglePwdBtn = document.getElementById('togglePwd');
    const eyeIcon = document.getElementById('eyeIcon');
    const wifiForm = document.getElementById('wifiForm');

    function sanitizeInput(s){
      const repl = { 'ä':'a','ö':'o','ü':'u','Ä':'A','Ö':'O','Ü':'U','ß':'ss' };
      return s.replace(/[\n\r]/g,'').replace(/[äöüÄÖÜß]/g, m=>repl[m]||'');
    }

    ssid.addEventListener('input', ()=>{ ssid.value = sanitizeInput(ssid.value); });
    pwd.addEventListener('input', ()=>{ pwd.value = pwd.value.replace(/[\n\r]/g,''); });

    wifiForm.addEventListener('submit', ()=>{
      ssid.value = encodeURIComponent(sanitizeInput(ssid.value));
      pwd.value = encodeURIComponent(pwd.value);
    });

    togglePwdBtn.addEventListener('click', ()=>{
      if(pwd.type === 'password'){
        pwd.type = 'text';
        eyeIcon.innerHTML = '<path d="M1 12s4-8 11-8 11 8 11 8-4 8-11 8-11-8-11-8z"/><line x1="1" y1="1" x2="23" y2="23"/>';
      } else {
        pwd.type = 'password';
        eyeIcon.innerHTML = '<path d="M1 12s4-8 11-8 11 8 11 8-4 8-11 8-11-8-11-8z"/><circle cx="12" cy="12" r="3"/>';
      }
    });
  </script>

</body>
</html>
)rawliteral";
#pragma endregion

#pragma region Loader
const char* html_loader = R"rawliteral(
<!doctype html>
<html lang="de">
<head>
  <meta charset="utf-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1" />
  <title>Ladebildschirm — Bushaltestelle</title>
  <style>
    :root{
      --sky:#87CEEB;
      --road:#555;
      --bus:#FFD600;
      --highlight:#4CAF50;
    }

    html,body{height:100%;margin:0;background:var(--sky);font-family:system-ui,Segoe UI,Roboto,Arial;overflow:hidden;}

    .loader-screen{position:fixed;inset:0;background:var(--sky);display:flex;flex-direction:column;align-items:center;justify-content:flex-end;overflow:hidden;}

    .clouds{position:absolute;top:10%;left:0;width:400%;display:flex;gap:60px;animation:moveSky 80s linear infinite;z-index:2;}
    .cloud{width:120px;height:70px;background:#fff;border-radius:50%;position:relative;filter:drop-shadow(2px 2px 3px rgba(0,0,0,0.2));}
    .cloud::before,.cloud::after{content:'';position:absolute;background:#fff;border-radius:50%;}
    .cloud::before{width:70px;height:70px;top:-25px;left:20px;}
    .cloud::after{width:90px;height:90px;top:-35px;left:50px;}

    .trees{position:absolute;bottom:120px;left:0;width:400%;display:flex;gap:50px;animation:moveSky 30s linear infinite;z-index:2;}
    .tree svg{height:150px;}

    .road{position:absolute;bottom:0;left:0;width:200%;height:120px;background:var(--road);z-index:1;}
    .lane{position:absolute;bottom:60px;left:0;width:200%;height:6px;background:repeating-linear-gradient(to right, #fff 0 50px, transparent 50px 100px);animation:drive 8s linear infinite;border-radius:3px;}

    .bus{position:absolute;bottom:110px;left:50%;transform:translateX(-50%);width:180px;height:80px;background:var(--bus);border-radius:15px 15px 8px 8px;box-shadow:0 6px 12px rgba(0,0,0,0.3);display:flex;align-items:center;justify-content:space-between;padding:0 12px;animation:busFloat 2s ease-in-out infinite alternate;z-index:3;}
    .window{width:38px;height:30px;background:#4CAF50;border-radius:5px;margin-top:10px;box-shadow:inset 0 2px 3px rgba(0,0,0,0.2);}
    .door{width:28px;height:50px;background:#4CAF50;border-radius:4px;margin-right:6px;box-shadow:inset 0 2px 3px rgba(0,0,0,0.2);}
    .wheel{width:24px;height:24px;background:#111;border-radius:50%;position:absolute;bottom:-12px;box-shadow:0 2px 3px rgba(0,0,0,0.5);}
    .wheel.left{left:30px;}
    .wheel.right{right:30px;}

    .dot-container{position:absolute;top:25%;width:100%;display:flex;justify-content:center;gap:6px;}
    .dot{width:12px;height:12px;background:var(--highlight);border-radius:50%;animation:dotBlink 1.2s infinite ease-in-out;}
    .dot:nth-child(2){animation-delay:0.2s;}
    .dot:nth-child(3){animation-delay:0.4s;}

    .message-box{
      position:absolute;
      bottom:240px;
      background:rgba(255,255,255,0.8);
      color:#111;
      padding:12px 18px;
      border-radius:10px;
      box-shadow:0 2px 6px rgba(0,0,0,0.3);
      font-size:1.1rem;
      text-align:center;
      max-width:80%;
    }

    @keyframes drive{0%{transform:translateX(0);}100%{transform:translateX(-50%);}}
    @keyframes moveSky{0%{transform:translateX(0);}100%{transform:translateX(-50%);}}
    @keyframes dotBlink{0%,80%,100%{opacity:0.3;}40%{opacity:1;}}
    @keyframes busFloat{0%{transform:translateX(-50%) translateY(0);}50%{transform:translateX(-50%) translateY(-5px);}100%{transform:translateX(-50%) translateY(0);}}

    @media (prefers-reduced-motion: reduce){.lane,.clouds,.trees,.dot,.bus{animation:none}}
  </style>
</head>
<body>
  <div class="loader-screen">
    <div class="clouds">
      <div class="cloud"></div><div class="cloud"></div><div class="cloud"></div>
      <div class="cloud"></div><div class="cloud"></div><div class="cloud"></div>
    </div>

    <div class="trees">
      <div class="tree">
        <svg viewBox="0 0 64 128" xmlns="http://www.w3.org/2000/svg">
          <rect x="28" y="80" width="8" height="48" fill="#8B4513"/>
          <circle cx="32" cy="64" r="32" fill="green"/>
        </svg>
      </div>
      <div class="tree">
        <svg viewBox="0 0 64 128" xmlns="http://www.w3.org/2000/svg">
          <rect x="28" y="80" width="8" height="48" fill="#8B4513"/>
          <circle cx="32" cy="64" r="32" fill="green"/>
        </svg>
      </div>
      <div class="tree">
        <svg viewBox="0 0 64 128" xmlns="http://www.w3.org/2000/svg">
          <rect x="28" y="80" width="8" height="48" fill="#8B4513"/>
          <circle cx="32" cy="64" r="32" fill="green"/>
        </svg>
      </div>
      <div class="tree">
        <svg viewBox="0 0 64 128" xmlns="http://www.w3.org/2000/svg">
          <rect x="28" y="80" width="8" height="48" fill="#8B4513"/>
          <circle cx="32" cy="64" r="32" fill="green"/>
        </svg>
      </div>
    </div>

    <div class="road"><div class="lane"></div></div>

    <div class="bus">
      <div class="window"></div>
      <div class="window"></div>
      <div class="door"></div>
      <div class="wheel left"></div>
      <div class="wheel right"></div>
    </div>

