EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
    <div class="dot-container">
      <div class="dot"></div><div class="dot"></div><div class="dot"></div>
    </div>

    <div class="message-box">%MESSAGE%</div>
  </div>

  <script>
    window.showBusLoader = ()=> document.querySelector('.loader-screen').style.display='flex';
    window.hideBusLoader = ()=> document.querySelector('.loader-screen').style.display='none';
  </script>
</body>
</html>
)rawliteral";
#pragma endregion
#pragma endregion

#pragma region Variables

#pragma region Globals
LiquidCrystal_I2C lcd(0x27, 16, 2); // The LCD-display
ESP8266WebServer server(80); // The webserver to be hosted
#pragma endregion

static const uint16_t WIFI_MAGIC = 0xA5A5;
static const int EEPROM_SIZE_BYTES = 512;
static const int EEPROM_ADDR = 0;

// EEPROM-backed storage for WiFi credentials
struct WifiCreds {
  uint16_t magic;
  uint8_t apiEnabled; // 0 = disabled, 1 = enabled
  char ssid[33];      // 32 chars + null
  char password[65];  // 64 chars + null
};

struct APIclient
{
  int id;
  char name[33];      // 32 chars + null
  char apiKey[17];  // 16 chars + null
};

class APIclientList
{
  private:
    static const int MAX_CLIENTS = 16;
    APIclient clients[MAX_CLIENTS];
    int clientCount = 0;
  public:
    const APIclient EMPTY_CLIENT = {-1, "none", "-1"};

    const APIclient* clients_get()
    {
      return clients;
    }

    const int clientCount_get()
    {
      return clientCount;
    }

    APIclient clients_getByID(int id)
    {
      if (id == -1)
      {
        return EMPTY_CLIENT;
      }

      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          return clients[i];
        }
      }
      return EMPTY_CLIENT;
    }

    bool clients_add(const APIclient& client)
    {
      if (clientCount >= MAX_CLIENTS)
      {
        return false; // List full
      }

      clients[clientCount] = client;
      clientCount++;
      return true;
    }
    
    bool clients_add(const char* name, const char* apiKey)
    {
      APIclient client;
      client.id = clientCount;
      strncpy(client.name, name, sizeof(client.name)-1);
      strncpy(client.apiKey, apiKey, sizeof(client.apiKey)-1);
      return clients_add(client);
    }

    void clients_clear()
    {
      clientCount = 0;
      memset(clients, 0, sizeof(clients));
    }

    void clients_removeByID(int id)
    {
      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          // Shift remaining clients down
          for (int j = i; j < clientCount - 1; j++)
          {
            clients[j] = clients[j + 1];
          }
          clientCount--;
          break;
        }
      }
    }

    void clients_setByID(int id, const char* name, const char* apiKey)
    {
      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          strncpy(clients[i].name, name, sizeof(clients[i].name)-1);
          strncpy(clients[i].apiKey, apiKey, sizeof(clients[i].apiKey)-1);
          break;
        }
      }
    }
  };

// WiFi login data
String ssid;
String password;

bool stopButtonVal = false; // The value of the stop button

bool apiActivated = false; // If the api requests go through (persisted in EEPROM)

// The text shown by the LCD
String line1Text = "";
String line2Text = "";

// The text shown by the LCD before the temp text was displayed
String line1prevText = "";
String line2prevText = "";

// Until this timestamp the temporary text is displayed
unsigned long displayTempTextUntil = 0;
#pragma endregion

#pragma region Method Declaration
void displayText(String line1, String line2);
void displayTextTemp(const String& line1, const String& line2, const int time);
void clearDisplay(int row);
void fetchPrefs();
void putPrefs();
void handleStopButton();
void handleDisplay();
void showLoadingScreen(int statusCode, const String& message);
void handleRoot();
void handlePreferences();
void handleClear();
void handleApiClear();
void handleApiSet();
void handleApiGet();
void handlePrefsApply();
void handlePrefsApi();
void handleSet();
void webServerRoutes();
#pragma endregion

#pragma region Hilfsfunktionen
//=======AUXILIARY FUNCTIONS========//

// Display text on the LCD
void displayText(String line1 = "", String line2 = "") {
  if (line1 != "")
    line1Text = line1;

  if (line2 != "")
    line2Text = line2;

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print(line1Text.c_str());
  lcd.setCursor(0, 1);
  lcd.print(line2Text.c_str());
}

// Display text for a set amount of time on the LCD. After the time has expired the current text is displayed again
void displayTextTemp(const String& line1, const String& line2, const int time) {
  line1prevText = line1Text;
  line2prevText = line2Text;
  displayTempTextUntil = millis() + time;
  displayText(line1, line2);
}

void clearDisplay(int row = -1)
{
  switch (row)
  {
  case -1:
    line1Text = "";
    line2Text = "";
    break;
  case 1:
    line1Text = "";
    break;
  case 2:
    line2Text = "";
    break;
  default:
    line1Text = "";
    line2Text = "";
    break;
  }
  displayText();
}

void fetchPrefs()
{
  EEPROM.begin(EEPROM_SIZE_BYTES);
  WifiCreds creds;
  // Read raw struct from EEPROM
  EEPROM.get(EEPROM_ADDR, creds);

  if (creds.magic == WIFI_MAGIC) {
    // Valid data present
    creds.ssid[sizeof(creds.ssid)-1] = '\0';
    creds.password[sizeof(creds.password)-1] = '\0';
    ssid = String(creds.ssid);
    password = String(creds.password);
    // Load persisted API flag
    apiActivated = (creds.apiEnabled != 0);
  } else {
    // No valid data -> use empty strings
    ssid = "";
    password = "";
    // Initialize EEPROM with an empty, valid record to avoid repeated reads
    memset(&creds, 0, sizeof(creds));
    creds.magic = WIFI_MAGIC;
    creds.apiEnabled = 0;
    EEPROM.put(EEPROM_ADDR, creds);
    EEPROM.commit();
  }

  EEPROM.end();
}

void putPrefs()
{
  EEPROM.begin(EEPROM_SIZE_BYTES);
  WifiCreds creds;
  memset(&creds, 0, sizeof(creds));
  creds.magic = WIFI_MAGIC;
  creds.apiEnabled = apiActivated ? 1 : 0;
  // Copy strings with boundary checks
  strncpy(creds.ssid, ssid.c_str(), sizeof(creds.ssid)-1);
  strncpy(creds.password, password.c_str(), sizeof(creds.password)-1);

